notes4a.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-16 Mon 11:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>FINA 3070 Notes 4A</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Ian Y.E. Pan" />
<link rel="stylesheet" type="text/css" href="imagine.css" />
</head>
<body>
<div id="content">
<h1 class="title">FINA 3070 Notes 4A</h1>
<div id="outline-container-org7089edd" class="outline-2">
<h2 id="org7089edd"><span class="section-number-2">1</span> True value of a bond</h2>
<div class="outline-text-2" id="text-1">
<p>
E.g. par = $100,000; maturity = 10 years; annual coupon 3%
(i.e. $3,000).
</p>
<ul class="org-ul">
<li>True value = PAR(coupons) + PAH(par value)</li>
<li>We use YTM of bonds of same rating as our r. Suppose it's 10%.</li>
<li>\(V = \sum_t \frac{3000}{(1.10)^t} + \frac{100,000}{(1.10)^{10}}
  \approx\) $57K.</li>
<li>This is a "discount bond" because its true value \(<\) par.</li>
<li>Suppose we have a higher annual coupon rate s.t. the true value \(>\)
par, then we have a "premium bond".</li>
</ul>
</div>
</div>
<div id="outline-container-orgc290598" class="outline-2">
<h2 id="orgc290598"><span class="section-number-2">2</span> Valuation of common stock</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Harder than valuation of bonds.</li>
<li>Uncertain dividends.</li>
<li>Hard to estimate "suitable discount rate".</li>
</ul>
</div>
</div>
<div id="outline-container-orgaebe947" class="outline-2">
<h2 id="orgaebe947"><span class="section-number-2">3</span> Three Different types of traders</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><b>Smart traders</b>: make use of public info (financial statements) to
estimate true value of shares. E.g. mutual fund managers.</li>
<li><b>Noise traders</b>: only guessing. E.g. speculators.</li>
<li><b>Insiders</b>: information asymmetry. E.g. CEO, managers of the firm.</li>
</ul>
</div>
</div>
<div id="outline-container-org502bcc6" class="outline-2">
<h2 id="org502bcc6"><span class="section-number-2">4</span> Efficient-Market Hypothesis</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Observed market price of a common stock reflects the relevant
information.</li>
<li>Smart traders matter; noise traders don't matter; insiders trade
infrequently.</li>
<li>Don't have to estimate true value by ourselves: the market prices
can already be trusted.</li>
</ul>
</div>
<div id="outline-container-org3a6f396" class="outline-3">
<h3 id="org3a6f396"><span class="section-number-3">4.1</span> Three forms of market efficiency</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org00caef8" class="outline-4">
<h4 id="org00caef8"><span class="section-number-4">4.1.1</span> Semi-strong form</h4>
<div class="outline-text-4" id="text-4-1-1">
<ul class="org-ul">
<li>Prices reflect all publicly available info.</li>
<li>(Will be our focus of study.)</li>
</ul>
</div>
</div>
<div id="outline-container-org397ad71" class="outline-4">
<h4 id="org397ad71"><span class="section-number-4">4.1.2</span> Weak form</h4>
<div class="outline-text-4" id="text-4-1-2">
<ul class="org-ul">
<li>Prices reflect only a subset of public info. E.g. past trading information.</li>
</ul>
</div>
</div>
<div id="outline-container-org505aac9" class="outline-4">
<h4 id="org505aac9"><span class="section-number-4">4.1.3</span> Strong form</h4>
<div class="outline-text-4" id="text-4-1-3">
<ul class="org-ul">
<li>Prices reflect all info, including insider information.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8ec7d2c" class="outline-3">
<h3 id="org8ec7d2c"><span class="section-number-3">4.2</span> School of Efficient Market v.s. School of Behavioural Finance</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>SEM believes that all bond (including investment-grade bonds and
junk bonds) and stock are efficient; SBF thinks that junk bonds and
common stocks are not efficient.</li>
<li>Most people regard investment-grade bonds are efficient &#x2013; very easy
to estimate true value. Almost strong-form efficient.</li>
<li>Junk bonds (risk of default) and common stocks have more severe info asymmetry.</li>
<li>Strong form doesn't hold for common stocks: empirical evidence shows
that insiders can indeed make abnormal profit, meaning that insider
info is not publicly available.</li>
</ul>
</div>
</div>
<div id="outline-container-orga5b661b" class="outline-3">
<h3 id="orga5b661b"><span class="section-number-3">4.3</span> Information asymmetry: HK v.s. US</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>Definition: a manager knows the company better than smart traders do.</li>
<li>More severe in HK than US:
<ul class="org-ul">
<li>Semi-annual financial report (HK) v.s. quarterly report (US).</li>
<li>Less detailed/reliable financial statements (HK) v.s. more
detailed/reliable (US).</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgd1ef176" class="outline-3">
<h3 id="orgd1ef176"><span class="section-number-3">4.4</span> When noise traders cause mispricing</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>SEM: smart traders will use risky arbitrage to drive stock price
back to true value per share immediately, eliminating any further
profit opportunities.</li>
<li>Risky arbitrage: buy under-priced stock by using capital from
(short-)selling a "similar" fairly-priced stock; or buy
fairly-priced stock by using capital from (short-)selling a
"similar" over-priced stock.</li>
<li>SBF: risky arbitrage might be costly and slow-working &#x2013; noise
traders can cause mispricing/deviation of stock price from true
value (in the short run).</li>
</ul>
</div>
</div>
<div id="outline-container-org1fab11a" class="outline-3">
<h3 id="org1fab11a"><span class="section-number-3">4.5</span> When new information comes in</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li>Suppose the arrival of new information that positively affects true
value per share: smart analysts will compete and quickly buy the
stock they believe is under-priced due to the new info. This active
risky arbitrage will push price up till equilibrium.</li>
<li>Market shall reach equilibrium before daily close (sometimes even
just 1 hr after news arrival).</li>
</ul>
</div>
<div id="outline-container-org919b260" class="outline-4">
<h4 id="org919b260"><span class="section-number-4">4.5.1</span> Event study: a tool to test semi-strong EMH</h4>
<div class="outline-text-4" id="text-4-5-1">
<ul class="org-ul">
<li>Assess the impact of a specific event on a firm's stock price.</li>
<li>Abnormal return due to the event is estimated as the difference
between the stock's actual return and a proxy for the stock's return
in the absence of the event.
<ul class="org-ul">
<li>The proxy is estimated by an index (e.g. Hang Seng Index).</li>
</ul></li>
<li>Abnormal return = actual return \(-\) normal return
<ul class="org-ul">
<li>Normal return can be estimated as \(\alpha + \beta r_m\), where
\(\alpha\) and \(\beta\) are estimated from the data of day -120 up to
day -20.</li>
<li>\(r_m\) is calculated as daily return, i.e. \(\frac{\text{price
    today}-\text{price yesterday}}{\text{price yesterday}}\).</li>
<li>Hence, abnormal return = actual return \(- (\alpha + \beta r_m)\)</li>
</ul></li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org54e76b0"></a>Pattern of abnormal returns in "inefficient market"<br />
<div class="outline-text-5" id="text-4-5-1-1">
<ul class="org-ul">
<li>See graph in Notes4A pp.18</li>
<li>It takes several days to go back to equilibrium &#x2013; market is slow to react.</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org19846f3" class="outline-4">
<h4 id="org19846f3"><span class="section-number-4">4.5.2</span> ACAR (Average Cumulative Abnormal Return)</h4>
<div class="outline-text-4" id="text-4-5-2">
<ul class="org-ul">
<li>Plot on Notes4A pp.20 has a high horizontal line after day 0,
because it's cumulative.</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="orgfd5f788"></a>Possible patterns of ACAR<br />
<div class="outline-text-5" id="text-4-5-2-1">
<ul class="org-ul">
<li>Normal: significant jump on day 0 (when the info arrives), and
random prices changes (which is normal) afterwards:
<ul class="org-ul">
<li>Semi-strong efficient.</li>
</ul></li>
<li>Insider: if there's a jump before day 0 &#x2013; possible information
leakage:
<ul class="org-ul">
<li>Evidence "against" strong form EMH.</li>
</ul></li>
<li>If price adjust slowly (slow reaction until horizontal line) or
overreacts (overshoots) then corrects itself (drop back to high
horizontal line):
<ul class="org-ul">
<li>Inefficient market.</li>
</ul></li>
</ul>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orge4d6ae9" class="outline-2">
<h2 id="orge4d6ae9"><span class="section-number-2">5</span> Seen One Bond, Seen Them All</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>SEM and SBF both agree: no controversy.</li>
<li>Horizontal demand curve: a commodity (e.g. newspaper) with close substitutes.</li>
<li>Bonds with same rating are regarded by investors as close substitutes for one another.</li>
<li>If a bond's true value is constant (no coupon rate change, same bond
rating etc.), there will be horizontal demand curve even if the
supply Q increases (shown in Notes4A pp.30)</li>
<li>If Q's increase triggers P's decrease (s.t. P \(<\) V), then risky
arbitrage will correct it almost immediately.</li>
</ul>
</div>
</div>
<div id="outline-container-org6232018" class="outline-2">
<h2 id="org6232018"><span class="section-number-2">6</span> Seen One Stock, Seen Them All (controversial)</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>This is an assumption by SEM only.</li>
<li>The expected return of an individual stock can be "replicated" by a
portfolio of stocks (i.e. no stock is unique: different stocks are
close substitutes).</li>
<li>SEM: horizontal demand curve.</li>
<li>SBF: downward-sloping demand curve in the short run.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd180940" class="outline-2">
<h2 id="orgd180940"><span class="section-number-2">7</span> Semi-strong efficiency: HK vs. US</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>US stock market is more efficient than HK. China stock market is
even less efficient.</li>
<li>HK has more severe info asymmetry: harder to value a HK stock's true value.</li>
<li>Risky arbitrage less active in HK than in US.</li>
</ul>
</div>
<div id="outline-container-org869eb75" class="outline-3">
<h3 id="org869eb75"><span class="section-number-3">7.1</span> Short-sales in "less allowed" in HK than in US</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>Short-selling is legal only for approx. half of the main-board
stocks in HK.</li>
<li>Even for stocks that can be short-sold, "free float" is small (for a
typical HK firm).
<ul class="org-ul">
<li>Free float: number of shares outstanding that are "not" held by
controlling stockholders. Because those major stockholders don't
hold to trade/sell.</li>
<li>Controlling stockers would obviously "not" lend shares for you to
short-sell.</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020</p>
<p class="author">Author: Ian Y.E. Pan</p>
<p class="date">Created: 2020-03-16 Mon 11:53</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
